---
kind: method
id: M:Autodesk.Revit.DB.FailureMessage.GetFailingElements
source: html/d4cb3371-7f54-d414-9e68-63c58a2da83f.htm
---
# Autodesk.Revit.DB.FailureMessage.GetFailingElements Method

Retrieves list of the elements that have caused the failure.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetFailingElements()
```

## Returns
The elements that have caused the failure.